


Network Working Group                                       M. Boucadair
Internet-Draft                                            France Telecom
Intended status: Standards Track                                R. Penno
Expires: April 11, 2011                                 Juniper Networks
                                                                 D. Wing
                                                                   Cisco
                                                         October 8, 2010


        DHCP and DHCPv6 Options for Port Control Protocol (PCP)
                         draft-bpw-pcp-dhcp-00

Abstract

   This document specifies DHCP (IPv4 and IPv6) Options to convey the IP
   address or a FQDN of a PCP Server.  A dedicated option to prevent
   overloading PCP Servers is also specified.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 11, 2011.

Copyright Notice

   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Boucadair, et al.        Expires April 11, 2011                 [Page 1]

Internet-Draft              PCP DHCP Options                October 2010


   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Consistent NAT and PCP Configuration . . . . . . . . . . . . .  3
   3.  DHCPv6 Options . . . . . . . . . . . . . . . . . . . . . . . .  4
     3.1.  PCP Server Address DHCPv6 Option . . . . . . . . . . . . .  4
     3.2.  PCP Server FQDN DHCPv6 Option  . . . . . . . . . . . . . .  5
     3.3.  PCP Service Time Wait DHCPv6 Option  . . . . . . . . . . .  6
     3.4.  Requirements . . . . . . . . . . . . . . . . . . . . . . .  7
   4.  DHCP PCP Option  . . . . . . . . . . . . . . . . . . . . . . .  8
     4.1.  PCP Server Address Sub-Option  . . . . . . . . . . . . . .  9
     4.2.  PCP Server FQDN Sub-Option . . . . . . . . . . . . . . . . 10
     4.3.  PCP Service Time Wait DHCP Sub-Option  . . . . . . . . . . 10
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 11
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 12
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 12
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 12
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 13






















Boucadair, et al.        Expires April 11, 2011                 [Page 2]

Internet-Draft              PCP DHCP Options                October 2010


1.  Introduction

   [I-D.wing-softwire-port-control-protocol] recommends the use of DHCP
   as one of the mechanisms to discover a PCP Server.  To that aim, this
   document defines DHCP [RFC2131] and DHCPv6 [RFC3315] Options which
   can be used to provision a PCP Server reachability information (IP
   address, FQDN) to a PCP Client.  The use of DHCP or DHCPv6 depends on
   the PCP deployment scenarios.

   For flexibility reasons, this document defines both IP address and
   FQDN Options.  It is up to Service Providers to decide which option
   is convenient for them according to their engineering policies.

   This document does not make any assumption on the IP address to be
   conveyed in a DHCP/DHCPv6 Option.  In particular, this document does
   not prevent Service Providers to use the IANA-to-be-assigned IP
   address [I-D.wing-softwire-port-control-protocol] to be conveyed in
   DHCP/DHCPv6 Options.

   In some deployment contexts, the PCP Server may be reachable with an
   IPv4 address but DHCPv6 is used to provision the PCP Client.  In such
   scenarios, this document suggests to include IPv4-mapped IPv6
   addresses (see Section 3.1) as a reachability information of the PCP
   Server (or use the domain name option).  As described in Section 3.1
   of [I-D.wing-behave-dns64-config], dual-stack hosts can issue IPv4
   datagrams successfully to that IP address.

   [[To do list: IA_NA, XXXX server and client behaviour.  FQDN: Section
   8 of RFC 3315]]


2.  Consistent NAT and PCP Configuration

   The PCP Server discovered through DHCP MUST be able to install
   mappings on the NAT that will be crossed by packets issued by the
   host or any terminal belonging to the same realm (e.g., DHCP client
   is embedded in a CP router).  If DHCP is used to provision the
   reachability information of a PCP Server, Service Providers SHOULD
   configure appropriately their DHCP servers to meet this requirement.
   In case this prerequisite is not met, customers would experience
   service troubles and their service(s) won't be delivered
   appropriately.

   Note that this constraint is implicitly met in scenarios where only
   one single PCP-controlled device is deployed in the network.






Boucadair, et al.        Expires April 11, 2011                 [Page 3]

Internet-Draft              PCP DHCP Options                October 2010


3.  DHCPv6 Options

   Two DHCPv6 Options defined in the following sub-sections are used to
   convey the PCP Server reachability information.  The first option
   (i.e., OPTION_PCP_SERVER_A) can be used to include an IPv6 address or
   an IPv4-mapped IPv6 address.  The second option (i.e.,
   OPTION_PCP_SERVER_D) conveys a domain name to be used to retrieve the
   IP address of the PCP Server.

   For example, in the context of a DS-Lite architecture
   [I-D.ietf-softwire-dual-stack-lite] DHCPv6 can be used to include the
   IPv4-mapped IPv6 address [RFC2373] of a PCP Server (a PCP Client can
   use an IPv4-mapped IPv6 address to send IPv4 PCP messages), and in
   the case of NAT64 [I-D.ietf-behave-v6v4-xlate-stateful] to provision
   the IPv6 address of the PCP Server.

   A third option (OPTION_PCP_SERVICE_T) is defined to convey a timer
   used to prevent overload events.

3.1.  PCP Server Address DHCPv6 Option

   This option specifies an IP address of the PCP Server to be used by
   the PCP Client to send PCP messages.




























Boucadair, et al.        Expires April 11, 2011                 [Page 4]

Internet-Draft              PCP DHCP Options                October 2010


       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVER_A      |        Option-length          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |                   PCP Server (IP address)                     |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |                   PCP Server (IP address)                     |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                                ....                           :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


               Figure 1: PCP Server IP Address DHCPv6 Option

   The description of the fields of the option shown in Figure 1 is
   described below:

   o  Option-code: OPTION_PCP_SERVER_A (TBA, see Section 6)

   o  Option-length: MUST be a multiple of 16.

   o  PCP Server: One or a list of IP address(es) of PCP Server(s) to be
      used by a PCP Client.  In particular, IPv4-mapped IPv6 addresses
      can be included in this field when the PCP Server is reachable
      over IPv4 (e.g., in a DS-Lite architecture, the PCP Server can be
      reachable over IPv4 (i.e., PCP messages will be encapsulated in
      IPv6).  An IPv4-mapped IPv6 address can be used to provision the
      PCP Client with the reachability information of the PCP Server).

   If several IP addresses are included in the option, these addresses
   MUST be listed in the order of preference.  A PCP Client MUST use a
   reachable address with higher preference order.

   In case several addresses are to be conveyed in a DHCPv6 option, it
   is RECOMMENDED to use OPTION_PCP_SERVER_D DHCPv6 option.

3.2.  PCP Server FQDN DHCPv6 Option

   This option includes a FQDN of the PCP Server to be used by the PCP
   Client.  In order to exploit this option, this document assumes that



Boucadair, et al.        Expires April 11, 2011                 [Page 5]

Internet-Draft              PCP DHCP Options                October 2010


   a DNS server is configured on the host client by DHCP or other means.

       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVER_D      |         Option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                    PCP Server Domain Name                     :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                  Figure 2: PCP Server FQDN DHCPv6 Option

   The fields of the option shown in Figure 2 are:

   o  Option-code: OPTION_PCP_SERVER_D (TBA, see Section 6)

   o  Option-length: Length of the 'PCP Server Domain Name' field in
      octets.  This length is variable.

   o  PCP Server Domain Name: The domain name of the PCP Server to be
      used by the PCP Client.  The domain name is encoded as specified
      in [RFC3315].

3.3.  PCP Service Time Wait DHCPv6 Option

   [NOTE: This section will be removed if the avalanche restart concern
   is handled by a generic initiative such as HomeGate.  See for example
   [RFC3435] how this issue is covered for MGCP.]

   In order to avoid overload phenomena (e.g., power outage event in a
   big city), the following option (Figure 3) is used to ask a PCP
   Client to wait N seconds before sending its first PCP message.  If no
   overload control mechanism is supported, avalanche restart phenomena
   would lead to a huge amount of requests to the PCP Server which would
   impact the serviceability of the PCP-controlled device and would even
   induce a service outage for a large number of customers serviced by
   the same CGN device.  Distributing all PCP requests in a random or a
   pre-defined manner will avoid experiencing load bursts.

   This option SHOULD be used only with a non-null TimeWait value.

   The format of the OPTION_PCP_SERVICE_T option is shown in Figure 3.








Boucadair, et al.        Expires April 11, 2011                 [Page 6]

Internet-Draft              PCP DHCP Options                October 2010


       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVICE_T     |         Option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |            Method             |          TimeWait             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   This option can be generalized to all services (e.g., SIP, PCP, NTP,
   etc.) by including a field which specifies the associated service.

               Figure 3: PCP Service TimeWait DHCPv6 Option

   The description of the fields of this option is as follows:

   o  Option-code: OPTION_PCP_SERVICE_T (TBA, see Section 6)

   o  Option-length: 4.

   o  Method: This field specifies the method to apply on the TimeWait.
      Two methods MUST be supported by any OPTION_PCP_SERVICE_T
      implementation:

         0: Basic.  When this method is used, the PCP Client MUST wait
         until the expiry of TimeWait seconds before issuing a PCP
         message.

         1: Random.  When this method is indicated, a RAND() function
         MUST be used to generate a value between 0 and TimeWait.  The
         PCP Client MUST wait until the expiry of the generated value
         before issuing a PCP message to a PCP Server.

   o  TimeWait: This field specifies a number of seconds to be used when
      applying the function indicated in the Method field.

3.4.  Requirements

   If OPTION_PCP_SERVER_D is used to configure the PCP Server, the
   client MUST issue a AAAA DNS query to resolve an IPv6 address, if the
   query has failed the PCP Client MUST issue an A DNS query.  [[Note:
   In order to avoid the delay, a field can be added to the option to
   inform the client about the type of the DNS query to be issued]]].

   OPTION_PCP_SERVER_D and OPTION_PCP_SERVER_A DHCPv6 option MUST be
   supported.  OPTION_PCP_SERVICE_T DHPCv6 option MAY (SHOULD?) be
   supported.





Boucadair, et al.        Expires April 11, 2011                 [Page 7]

Internet-Draft              PCP DHCP Options                October 2010


4.  DHCP PCP Option

   The PCP Server DHCP Option can be used to configure an IPv4 address
   or a DNS FQDN to be used by the PCP Client to contact a PCP Server.
   It can also be used to indicate a timer to constraint emitting PCP
   messages.  The generic format of this option is illustrated in
   Figure 4.

       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Code      |    Length     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                         Sub-option 1                          :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                             ...                               :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                        Sub-option n                           :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                         Figure 4: DHCP PCP Option

   o  Code: OPTION_PCP_SERVER (TBA, see Section 6);

   o  Length: Includes the length of included sub-options;

   o  One or several sub-options can be included in a PCP DHCP option.
      The format of each sub-option follows the structure shown in
      Figure 5.

       Sub-option
          Code   Len   Data
         +-----+-----+-----...---+
         | code|  n  |  Data     |
         +-----+-----+-----...---+


                      Figure 5: PCP Server sub-option

   Three sub-options are defined in this document:

      1: PCP Server Address Sub-option (Section 4.1);




Boucadair, et al.        Expires April 11, 2011                 [Page 8]

Internet-Draft              PCP DHCP Options                October 2010


      2: PCP Domain Name Sub-option (Section 4.2);

      3: PCP Service Time Wait Sub-option (Section 4.3).

   Both PCP Server Address and PCP Domain Name Sub-options MUST be
   supported.  PCP Service Time Wait Sub-option MAY (SHOULD?) be
   supported.

   PCP Server Address Sub-option and PCP Domain Name Sub-option are
   exclusive.

   PCP Service Time Wait Sub-option MAY be jointly included in the same
   DHCP message carrying PCP Server Address Sub-option or PCP Domain
   Name Sub-option.

   When a PCP Domain Name Sub-option is used, the PCP client MUST issue
   A DNS queries to retrieve an IPv4 address.

4.1.  PCP Server Address Sub-Option

   This sub-option specifies one or a list of IPv4 addresses of the PCP
   Server to be used by the PCP Client to send PCP messages.

       Sub-option
          Code   Len   PCP Server IP Address  PCP Server IP Address
         +-----+-----+-----+-----+-----+-----+-----+-----+--
         |  1  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 | ...
         +-----+-----+-----+-----+-----+-----+-----+-----+--


   This format assumes that an IPv4 address is encoded as a1.a2.a3.a4.

             Figure 6: PCP Server IPv4 Address DHCP Sub-Option

   The fields of the sub-option shown in Figure 6 are:

   o  Sub-option Code: 1.

   o  Len: Must be a multiple of 4.

   o  PCP Server IP Address: contains one or several IPv4 addresses of a
      PCP Server to be used by a PCP Client.  If several addresses are
      included, they are included in the preference order.  A client
      MUST use the reachable address with the highest preference order.
      Instead of including several addresses in the DHCP option, it is
      RECOMMENDED to use PCP Server FQDN Sub-option.





Boucadair, et al.        Expires April 11, 2011                 [Page 9]

Internet-Draft              PCP DHCP Options                October 2010


4.2.  PCP Server FQDN Sub-Option

   This sub-option includes a FQDN of the PCP Server to be used by the
   PCP Client to send PCP messages.  In order to exploit this option,
   this document assumes that a DNS server is configured on the host
   client by DHCP or other means.

        Sub-option
          Code  Len   FQDN of PCP Server
         +-----+-----+-----+-----+-----+-----+-----+--
         |  2  |  n  |  s1 |  s2 |  s3 |  s4 | s5  |  ...
         +-----+-----+-----+-----+-----+-----+-----+--


                 Figure 7: PCP Server FQDN DHCP Sub-option

   The fields of the sub-option shown in Figure 7 are:

   o  Sub-option Code: 2.

   o  Len: Length of the "PCP Server Domain Name" field in octets.  This
      length is variable.

   o  PCP Server Domain Name: The domain name of the PCP Server to be
      used by the PCP Client.  The encoding of the domain name is
      described [RFC2131].

4.3.  PCP Service Time Wait DHCP Sub-Option

   [NOTE: This section will be removed if the avalanche restart concern
   is handled by a generic initiative such as HomeGate]

   This sub-option is used to indicate to a host, the time to wait
   before issuing a PCP message.  The purpose of this option is to
   prevent overload phenomena.  This sub-option SHOULD be used only with
   a non-null TimeWait value.

   The format of the PCP Service Time Wait DHCP Sub-option is shown in
   Figure 8.












Boucadair, et al.        Expires April 11, 2011                [Page 10]

Internet-Draft              PCP DHCP Options                October 2010


       Sub-option
          Code   Len  Method   TimeWait
         +-----+-----+-----+-----+-----+
         |  3  |  3  |  M  |  TimeWait |
         +-----+-----+-----+-----+-----+


              Figure 8: PCP Service TimeWait DHCP Sub-option

   The fields of this sub-option are:

   o  Sub-option Code: 3.

   o  Len: 3.

   o  Method: This field specifies the method to apply on the TimeWait.
      Two methods MUST be supported:

         0: Basic.  When this method is indicated, the PCP Client MUST
         wait until the expiry of TimeWait seconds before issuing a PCP
         message.

         1: Random.  When this method is indicated, a RAND() function
         MUST be used to generate a value between 0 and TimeWait.  The
         PCP Client MUST wait until the expiry of the generated value
         before issuing a PCP message to a PCP Server.

   o  TimeWait: This field specifies a number of seconds to be used when
      applying the function indicated in the Method field.


5.  Security Considerations

   The security considerations in [RFC2131], [RFC3315] and
   [I-D.wing-softwire-port-control-protocol] are to be considered.


6.  IANA Considerations

   This document request three DHCPv6 Option codes and one DHCP Option
   code.

   DHCPv6 Option codes:

   1.  OPTION_PCP_SERVER_A

   2.  OPTION_PCP_SERVER_D




Boucadair, et al.        Expires April 11, 2011                [Page 11]

Internet-Draft              PCP DHCP Options                October 2010


   3.  OPTION_PCP_SERVICE_T

   DHCP Option code:

   1.  OPTION_PCP_SERVER


7.  Acknowledgements

   Many thanks to B. Volz and C. Jacquenet for their review and
   comments.


8.  References

8.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2131]  Droms, R., "Dynamic Host Configuration Protocol",
              RFC 2131, March 1997.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

8.2.  Informative References

   [I-D.ietf-behave-v6v4-xlate-stateful]
              Bagnulo, M., Matthews, P., and I. Beijnum, "Stateful
              NAT64: Network Address and Protocol Translation from IPv6
              Clients to IPv4 Servers",
              draft-ietf-behave-v6v4-xlate-stateful-12 (work in
              progress), July 2010.

   [I-D.ietf-softwire-dual-stack-lite]
              Durand, A., Droms, R., Woodyatt, J., and Y. Lee, "Dual-
              Stack Lite Broadband Deployments Following IPv4
              Exhaustion", draft-ietf-softwire-dual-stack-lite-06 (work
              in progress), August 2010.

   [I-D.wing-behave-dns64-config]
              Wing, D., "DNS64 Resolvers and Dual-Stack Hosts",
              draft-wing-behave-dns64-config-02 (work in progress),
              February 2010.

   [I-D.wing-softwire-port-control-protocol]



Boucadair, et al.        Expires April 11, 2011                [Page 12]

Internet-Draft              PCP DHCP Options                October 2010


              Wing, D., Penno, R., and M. Boucadair, "Pinhole Control
              Protocol (PCP)",
              draft-wing-softwire-port-control-protocol-02 (work in
              progress), July 2010.

   [RFC2373]  Hinden, R. and S. Deering, "IP Version 6 Addressing
              Architecture", RFC 2373, July 1998.

   [RFC3435]  Andreasen, F. and B. Foster, "Media Gateway Control
              Protocol (MGCP) Version 1.0", RFC 3435, January 2003.


Authors' Addresses

   Mohamed Boucadair
   France Telecom
   Rennes,   35000
   France

   Email: mohamed.boucadair@orange-ftgroup.com


   Reinaldo Penno
   Juniper Networks
   1194 N Mathilda Avenue
   Sunnyvale, California  94089
   USA

   Email: rpenno@juniper.net


   Dan Wing
   Cisco Systems, Inc.
   170 West Tasman Drive
   San Jose, California  95134
   USA

   Email: dwing@cisco.com













Boucadair, et al.        Expires April 11, 2011                [Page 13]


